tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
# Automatically restart SSH sessions and tunnels
brew "autossh"
# Interactive Commitizen CLI that generate standardized commit messages
brew "czg", link: false
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# AVH edition of git-flow
brew "git-flow-avh"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Fast, simple & powerful blog framework
brew "hexo"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Monitor data's progress through a pipe
brew "pv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Code-search similar to ack
brew "the_silver_searcher"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Yet Another Dotfiles Manager
brew "yadm"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Allows connection to a computer remotely
cask "anydesk"
# Desktop wrapper for OpenAI ChatGPT
cask "chatgpt"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# File archiver
cask "keka"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Research management tool
cask "mendeley"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Minimal installer for conda
cask "miniconda"
# App to write, plan, collaborate, and get organized
cask "notion"
# Scheduling application focusing on organization
cask "omnifocus"
# IDE for professional Python development
cask "pycharm"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# LaTeX editor
cask "texifier"
# Open-source code editor
cask "visual-studio-code"
# Free messaging and calling application
cask "wechat"
# Video communication and virtual meeting platform
cask "zoom"
